espressif/arduino-esp32/tools/ide-debug/svd/esp32c3.svd
        <register>
          <name>CORE_0_RCD_PDEBUGSP</name>
          <description>ASSIST_DEBUG_CORE_0_RCD_PDEBUGSP_REG</description>
          <addressOffset>0x4C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE_0_RCD_PDEBUGSP</name>
              <description>reg_core_0_rcd_pdebugsp</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_0_IRAM0_EXCEPTION_MONITOR_0</name>
          <description>ASSIST_DEBUG_CORE_0_RCD_PDEBUGSP_REG</description>
          <addressOffset>0x50</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE_0_IRAM0_RECORDING_ADDR_0</name>
              <description>reg_core_0_iram0_recording_addr_0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CORE_0_IRAM0_RECORDING_WR_0</name>
              <description>reg_core_0_iram0_recording_wr_0</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CORE_0_IRAM0_RECORDING_LOADSTORE_0</name>
              <description>reg_core_0_iram0_recording_loadstore_0</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_0_IRAM0_EXCEPTION_MONITOR_1</name>
          <description>ASSIST_DEBUG_CORE_0_IRAM0_EXCEPTION_MONITOR_1_REG</description>
          <addressOffset>0x54</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE_0_IRAM0_RECORDING_ADDR_1</name>
              <description>reg_core_0_iram0_recording_addr_1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CORE_0_IRAM0_RECORDING_WR_1</name>
              <description>reg_core_0_iram0_recording_wr_1</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CORE_0_IRAM0_RECORDING_LOADSTORE_1</name>
              <description>reg_core_0_iram0_recording_loadstore_1</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_0_DRAM0_EXCEPTION_MONITOR_0</name>
          <description>ASSIST_DEBUG_CORE_0_DRAM0_EXCEPTION_MONITOR_0_REG</description>
          <addressOffset>0x58</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE_0_DRAM0_RECORDING_ADDR_0</name>
              <description>reg_core_0_dram0_recording_addr_0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CORE_0_DRAM0_RECORDING_WR_0</name>
              <description>reg_core_0_dram0_recording_wr_0</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CORE_0_DRAM0_RECORDING_BYTEEN_0</name>
              <description>reg_core_0_dram0_recording_byteen_0</description>
              <bitOffset>25</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_0_DRAM0_EXCEPTION_MONITOR_1</name>
          <description>ASSIST_DEBUG_CORE_0_DRAM0_EXCEPTION_MONITOR_1_REG</description>
          <addressOffset>0x5C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE_0_DRAM0_RECORDING_PC_0</name>
              <description>reg_core_0_dram0_recording_pc_0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_0_DRAM0_EXCEPTION_MONITOR_2</name>
          <description>ASSIST_DEBUG_CORE_0_DRAM0_EXCEPTION_MONITOR_1_REG</description>
          <addressOffset>0x60</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE_0_DRAM0_RECORDING_ADDR_1</name>
              <description>reg_core_0_dram0_recording_addr_1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CORE_0_DRAM0_RECORDING_WR_1</name>
              <description>reg_core_0_dram0_recording_wr_1</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CORE_0_DRAM0_RECORDING_BYTEEN_1</name>
              <description>reg_core_0_dram0_recording_byteen_1</description>
              <bitOffset>25</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_0_DRAM0_EXCEPTION_MONITOR_3</name>
          <description>ASSIST_DEBUG_CORE_0_DRAM0_EXCEPTION_MONITOR_3_REG</description>
          <addressOffset>0x64</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE_0_DRAM0_RECORDING_PC_1</name>
              <description>reg_core_0_dram0_recording_pc_1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_X_IRAM0_DRAM0_EXCEPTION_MONITOR_0</name>
          <description>ASSIST_DEBUG_CORE_X_IRAM0_DRAM0_EXCEPTION_MONITOR_0_REG</description>
          <addressOffset>0x68</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE_X_IRAM0_DRAM0_LIMIT_CYCLE_0</name>
              <description>reg_core_x_iram0_dram0_limit_cycle_0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>20</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_X_IRAM0_DRAM0_EXCEPTION_MONITOR_1</name>
          <description>ASSIST_DEBUG_CORE_X_IRAM0_DRAM0_EXCEPTION_MONITOR_1_REG</description>
          <addressOffset>0x6C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE_X_IRAM0_DRAM0_LIMIT_CYCLE_1</name>
              <description>reg_core_x_iram0_dram0_limit_cycle_1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>20</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LOG_SETTING</name>
          <description>ASSIST_DEBUG_LOG_SETTING</description>
          <addressOffset>0x70</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000080</resetValue>
          <fields>
            <field>
              <name>LOG_ENA</name>
              <description>reg_log_ena</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LOG_MODE</name>
              <description>reg_log_mode</description>
              <bitOffset>3</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LOG_MEM_LOOP_ENABLE</name>
              <description>reg_log_mem_loop_enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LOG_DATA_0</name>
          <description>ASSIST_DEBUG_LOG_DATA_0_REG</description>
          <addressOffset>0x74</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>LOG_DATA_0</name>
              <description>reg_log_data_0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LOG_DATA_MASK</name>
          <description>ASSIST_DEBUG_LOG_DATA_MASK_REG</description>
          <addressOffset>0x78</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>LOG_DATA_SIZE</name>
              <description>reg_log_data_size</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LOG_MIN</name>
          <description>ASSIST_DEBUG_LOG_MIN_REG</description>
          <addressOffset>0x7C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>LOG_MIN</name>
              <description>reg_log_min</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LOG_MAX</name>
          <description>ASSIST_DEBUG_LOG_MAX_REG</description>
          <addressOffset>0x80</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>LOG_MAX</name>
              <description>reg_log_max</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LOG_MEM_START</name>
          <description>ASSIST_DEBUG_LOG_MEM_START_REG</description>
          <addressOffset>0x84</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>LOG_MEM_START</name>
              <description>reg_log_mem_start</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LOG_MEM_END</name>
          <description>ASSIST_DEBUG_LOG_MEM_END_REG</description>
          <addressOffset>0x88</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>LOG_MEM_END</name>
              <description>reg_log_mem_end</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LOG_MEM_WRITING_ADDR</name>
          <description>ASSIST_DEBUG_LOG_MEM_WRITING_ADDR_REG</description>
          <addressOffset>0x8C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>LOG_MEM_WRITING_ADDR</name>
              <description>reg_log_mem_writing_addr</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LOG_MEM_FULL_FLAG</name>
          <description>ASSIST_DEBUG_LOG_MEM_FULL_FLAG_REG</description>
          <addressOffset>0x90</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>LOG_MEM_FULL_FLAG</name>
              <description>reg_log_mem_full_flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CLR_LOG_MEM_FULL_FLAG</name>
              <description>reg_clr_log_mem_full_flag</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>C0RE_0_LASTPC_BEFORE_EXCEPTION</name>
          <description>ASSIST_DEBUG_C0RE_0_LASTPC_BEFORE_EXCEPTION</description>
          <addressOffset>0x94</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE_0_LASTPC_BEFORE_EXC</name>
              <description>reg_core_0_lastpc_before_exc</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>C0RE_0_DEBUG_MODE</name>
          <description>ASSIST_DEBUG_C0RE_0_DEBUG_MODE</description>
          <addressOffset>0x98</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE_0_DEBUG_MODE</name>
              <description>reg_core_0_debug_mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CORE_0_DEBUG_MODULE_ACTIVE</name>
              <description>reg_core_0_debug_module_active</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DATE</name>
          <description>ASSIST_DEBUG_DATE_REG</description>
          <addressOffset>0x1FC</addressOffset>
          <size>0x20</size>
          <resetValue>0x02008010</resetValue>
          <fields>
            <field>
              <name>ASSIST_DEBUG_DATE</name>
              <description>reg_assist_debug_date</description>
              <bitOffset>0</bitOffset>
              <bitWidth>28</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
