espressif/arduino-esp32/tools/ide-debug/svd/esp32c3.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>LEDC</name>
      <description>LED Control PWM (Pulse Width Modulation)</description>
      <groupName>LEDC</groupName>
      <baseAddress>0x60019000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0xB0</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>LEDC</name>
        <value>23</value>
      </interrupt>
      <registers>
        <register>
          <dim>6</dim>
          <dimIncrement>0x14</dimIncrement>
          <dimIndex>0-5</dimIndex>
          <name>CH%s_CONF0</name>
          <description>LEDC_LSCH%s_CONF%s.</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>TIMER_SEL</name>
              <description>reg_timer_sel_lsch0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SIG_OUT_EN</name>
              <description>reg_sig_out_en_lsch0.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IDLE_LV</name>
              <description>reg_idle_lv_lsch0.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PARA_UP</name>
              <description>reg_para_up_lsch0.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>OVF_NUM</name>
              <description>reg_ovf_num_lsch0.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OVF_CNT_EN</name>
              <description>reg_ovf_cnt_en_lsch0.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OVF_CNT_RESET</name>
              <description>reg_ovf_cnt_reset_lsch0.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>6</dim>
          <dimIncrement>0x14</dimIncrement>
          <dimIndex>0-5</dimIndex>
          <name>CH%s_HPOINT</name>
          <description>LEDC_LSCH%s_HPOINT.</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>HPOINT</name>
              <description>reg_hpoint_lsch0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>6</dim>
          <dimIncrement>0x14</dimIncrement>
          <dimIndex>0-5</dimIndex>
          <name>CH%s_DUTY</name>
          <description>LEDC_LSCH%s_DUTY.</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>DUTY</name>
              <description>reg_duty_lsch0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>19</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>6</dim>
          <dimIncrement>0x14</dimIncrement>
          <dimIndex>0-5</dimIndex>
          <name>CH%s_CONF1</name>
          <description>LEDC_LSCH%s_CONF1.</description>
          <addressOffset>0xC</addressOffset>
          <size>0x20</size>
          <resetValue>0x40000000</resetValue>
          <fields>
            <field>
              <name>DUTY_SCALE</name>
              <description>reg_duty_scale_lsch0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DUTY_CYCLE</name>
              <description>reg_duty_cycle_lsch0.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DUTY_NUM</name>
              <description>reg_duty_num_lsch0.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DUTY_INC</name>
              <description>reg_duty_inc_lsch0.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DUTY_START</name>
              <description>reg_duty_start_lsch0.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>6</dim>
          <dimIncrement>0x14</dimIncrement>
          <dimIndex>0-5</dimIndex>
          <name>CH%s_DUTY_R</name>
          <description>LEDC_LSCH%s_DUTY_R.</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>DUTY_R</name>
              <description>reg_duty_lsch0_r.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>19</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>4</dim>
          <dimIncrement>0x8</dimIncrement>
          <dimIndex>0-3</dimIndex>
          <name>TIMER%s_CONF</name>
          <description>LEDC_LSTIMER%s_CONF.</description>
          <addressOffset>0xA0</addressOffset>
          <size>0x20</size>
          <resetValue>0x00800000</resetValue>
          <fields>
            <field>
              <name>DUTY_RES</name>
              <description>reg_lstimer0_duty_res.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CLK_DIV</name>
              <description>reg_clk_div_lstimer0.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>18</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PAUSE</name>
              <description>reg_lstimer0_pause.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RST</name>
              <description>reg_lstimer0_rst.</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TICK_SEL</name>
              <description>reg_tick_sel_lstimer0.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PARA_UP</name>
              <description>reg_lstimer0_para_up.</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>4</dim>
          <dimIncrement>0x8</dimIncrement>
          <dimIndex>0-3</dimIndex>
          <name>TIMER%s_VALUE</name>
          <description>LEDC_LSTIMER%s_VALUE.</description>
          <addressOffset>0xA4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CNT</name>
              <description>reg_lstimer0_cnt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_RAW</name>
          <description>LEDC_INT_RAW.</description>
          <addressOffset>0xC0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>LSTIMER0_OVF_INT_RAW</name>
              <description>reg_lstimer0_ovf_int_raw.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LSTIMER1_OVF_INT_RAW</name>
              <description>reg_lstimer1_ovf_int_raw.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LSTIMER2_OVF_INT_RAW</name>
              <description>reg_lstimer2_ovf_int_raw.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LSTIMER3_OVF_INT_RAW</name>
              <description>reg_lstimer3_ovf_int_raw.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DUTY_CHNG_END_LSCH0_INT_RAW</name>
              <description>reg_duty_chng_end_lsch0_int_raw.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DUTY_CHNG_END_LSCH1_INT_RAW</name>
              <description>reg_duty_chng_end_lsch1_int_raw.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DUTY_CHNG_END_LSCH2_INT_RAW</name>
              <description>reg_duty_chng_end_lsch2_int_raw.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DUTY_CHNG_END_LSCH3_INT_RAW</name>
              <description>reg_duty_chng_end_lsch3_int_raw.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DUTY_CHNG_END_LSCH4_INT_RAW</name>
              <description>reg_duty_chng_end_lsch4_int_raw.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DUTY_CHNG_END_LSCH5_INT_RAW</name>
              <description>reg_duty_chng_end_lsch5_int_raw.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OVF_CNT_LSCH0_INT_RAW</name>
              <description>reg_ovf_cnt_lsch0_int_raw.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OVF_CNT_LSCH1_INT_RAW</name>
              <description>reg_ovf_cnt_lsch1_int_raw.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OVF_CNT_LSCH2_INT_RAW</name>
              <description>reg_ovf_cnt_lsch2_int_raw.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OVF_CNT_LSCH3_INT_RAW</name>
              <description>reg_ovf_cnt_lsch3_int_raw.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OVF_CNT_LSCH4_INT_RAW</name>
              <description>reg_ovf_cnt_lsch4_int_raw.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OVF_CNT_LSCH5_INT_RAW</name>
              <description>reg_ovf_cnt_lsch5_int_raw.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_ST</name>
          <description>LEDC_INT_ST.</description>
          <addressOffset>0xC4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>LSTIMER0_OVF_INT_ST</name>
              <description>reg_lstimer0_ovf_int_st.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LSTIMER1_OVF_INT_ST</name>
              <description>reg_lstimer1_ovf_int_st.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LSTIMER2_OVF_INT_ST</name>
              <description>reg_lstimer2_ovf_int_st.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LSTIMER3_OVF_INT_ST</name>
              <description>reg_lstimer3_ovf_int_st.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DUTY_CHNG_END_LSCH0_INT_ST</name>
              <description>reg_duty_chng_end_lsch0_int_st.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DUTY_CHNG_END_LSCH1_INT_ST</name>
              <description>reg_duty_chng_end_lsch1_int_st.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DUTY_CHNG_END_LSCH2_INT_ST</name>
              <description>reg_duty_chng_end_lsch2_int_st.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DUTY_CHNG_END_LSCH3_INT_ST</name>
              <description>reg_duty_chng_end_lsch3_int_st.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DUTY_CHNG_END_LSCH4_INT_ST</name>
              <description>reg_duty_chng_end_lsch4_int_st.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DUTY_CHNG_END_LSCH5_INT_ST</name>
              <description>reg_duty_chng_end_lsch5_int_st.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OVF_CNT_LSCH0_INT_ST</name>
              <description>reg_ovf_cnt_lsch0_int_st.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OVF_CNT_LSCH1_INT_ST</name>
              <description>reg_ovf_cnt_lsch1_int_st.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OVF_CNT_LSCH2_INT_ST</name>
              <description>reg_ovf_cnt_lsch2_int_st.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OVF_CNT_LSCH3_INT_ST</name>
              <description>reg_ovf_cnt_lsch3_int_st.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OVF_CNT_LSCH4_INT_ST</name>
              <description>reg_ovf_cnt_lsch4_int_st.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OVF_CNT_LSCH5_INT_ST</name>
              <description>reg_ovf_cnt_lsch5_int_st.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_ENA</name>
          <description>LEDC_INT_ENA.</description>
          <addressOffset>0xC8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>LSTIMER0_OVF_INT_ENA</name>
              <description>reg_lstimer0_ovf_int_ena.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LSTIMER1_OVF_INT_ENA</name>
              <description>reg_lstimer1_ovf_int_ena.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LSTIMER2_OVF_INT_ENA</name>
              <description>reg_lstimer2_ovf_int_ena.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LSTIMER3_OVF_INT_ENA</name>
              <description>reg_lstimer3_ovf_int_ena.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DUTY_CHNG_END_LSCH0_INT_ENA</name>
              <description>reg_duty_chng_end_lsch0_int_ena.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DUTY_CHNG_END_LSCH1_INT_ENA</name>
              <description>reg_duty_chng_end_lsch1_int_ena.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DUTY_CHNG_END_LSCH2_INT_ENA</name>
              <description>reg_duty_chng_end_lsch2_int_ena.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DUTY_CHNG_END_LSCH3_INT_ENA</name>
              <description>reg_duty_chng_end_lsch3_int_ena.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DUTY_CHNG_END_LSCH4_INT_ENA</name>
              <description>reg_duty_chng_end_lsch4_int_ena.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DUTY_CHNG_END_LSCH5_INT_ENA</name>
              <description>reg_duty_chng_end_lsch5_int_ena.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OVF_CNT_LSCH0_INT_ENA</name>
              <description>reg_ovf_cnt_lsch0_int_ena.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OVF_CNT_LSCH1_INT_ENA</name>
              <description>reg_ovf_cnt_lsch1_int_ena.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OVF_CNT_LSCH2_INT_ENA</name>
              <description>reg_ovf_cnt_lsch2_int_ena.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OVF_CNT_LSCH3_INT_ENA</name>
              <description>reg_ovf_cnt_lsch3_int_ena.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OVF_CNT_LSCH4_INT_ENA</name>
              <description>reg_ovf_cnt_lsch4_int_ena.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OVF_CNT_LSCH5_INT_ENA</name>
              <description>reg_ovf_cnt_lsch5_int_ena.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
