espressif/arduino-esp32/tools/ide-debug/svd/esp32c3.svd
        <register>
          <name>CORE_0_PIF_PMS_CONSTRAIN_1</name>
          <description>SENSITIVE_CORE_0_PIF_PMS_CONSTRAIN_1_REG</description>
          <addressOffset>0xDC</addressOffset>
          <size>0x20</size>
          <resetValue>0xCF0FFFFF</resetValue>
          <fields>
            <field>
              <name>CORE_0_PIF_PMS_CONSTRAIN_WORLD_0_UART</name>
              <description>core_0_pif_pms_constrain_world_0_uart</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_0_PIF_PMS_CONSTRAIN_WORLD_0_G0SPI_1</name>
              <description>core_0_pif_pms_constrain_world_0_g0spi_1</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_0_PIF_PMS_CONSTRAIN_WORLD_0_G0SPI_0</name>
              <description>core_0_pif_pms_constrain_world_0_g0spi_0</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_0_PIF_PMS_CONSTRAIN_WORLD_0_GPIO</name>
              <description>core_0_pif_pms_constrain_world_0_gpio</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_0_PIF_PMS_CONSTRAIN_WORLD_0_FE2</name>
              <description>core_0_pif_pms_constrain_world_0_fe2</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_0_PIF_PMS_CONSTRAIN_WORLD_0_FE</name>
              <description>core_0_pif_pms_constrain_world_0_fe</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_0_PIF_PMS_CONSTRAIN_WORLD_0_TIMER</name>
              <description>core_0_pif_pms_constrain_world_0_timer</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_0_PIF_PMS_CONSTRAIN_WORLD_0_RTC</name>
              <description>core_0_pif_pms_constrain_world_0_rtc</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_0_PIF_PMS_CONSTRAIN_WORLD_0_IO_MUX</name>
              <description>core_0_pif_pms_constrain_world_0_io_mux</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_0_PIF_PMS_CONSTRAIN_WORLD_0_WDG</name>
              <description>core_0_pif_pms_constrain_world_0_wdg</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_0_PIF_PMS_CONSTRAIN_WORLD_0_MISC</name>
              <description>core_0_pif_pms_constrain_world_0_misc</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_0_PIF_PMS_CONSTRAIN_WORLD_0_I2C</name>
              <description>core_0_pif_pms_constrain_world_0_i2c</description>
              <bitOffset>26</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_0_PIF_PMS_CONSTRAIN_WORLD_0_UART1</name>
              <description>core_0_pif_pms_constrain_world_0_uart1</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_0_PIF_PMS_CONSTRAIN_2</name>
          <description>SENSITIVE_CORE_0_PIF_PMS_CONSTRAIN_2_REG</description>
          <addressOffset>0xE0</addressOffset>
          <size>0x20</size>
          <resetValue>0xFCC30CF3</resetValue>
          <fields>
            <field>
              <name>CORE_0_PIF_PMS_CONSTRAIN_WORLD_0_BT</name>
              <description>core_0_pif_pms_constrain_world_0_bt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_0_PIF_PMS_CONSTRAIN_WORLD_0_I2C_EXT0</name>
              <description>core_0_pif_pms_constrain_world_0_i2c_ext0</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_0_PIF_PMS_CONSTRAIN_WORLD_0_UHCI0</name>
              <description>core_0_pif_pms_constrain_world_0_uhci0</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_0_PIF_PMS_CONSTRAIN_WORLD_0_RMT</name>
              <description>core_0_pif_pms_constrain_world_0_rmt</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_0_PIF_PMS_CONSTRAIN_WORLD_0_LEDC</name>
              <description>core_0_pif_pms_constrain_world_0_ledc</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_0_PIF_PMS_CONSTRAIN_WORLD_0_BB</name>
              <description>core_0_pif_pms_constrain_world_0_bb</description>
              <bitOffset>22</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_0_PIF_PMS_CONSTRAIN_WORLD_0_TIMERGROUP</name>
              <description>core_0_pif_pms_constrain_world_0_timergroup</description>
              <bitOffset>26</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_0_PIF_PMS_CONSTRAIN_WORLD_0_TIMERGROUP1</name>
              <description>core_0_pif_pms_constrain_world_0_timergroup1</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_0_PIF_PMS_CONSTRAIN_WORLD_0_SYSTIMER</name>
              <description>core_0_pif_pms_constrain_world_0_systimer</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_0_PIF_PMS_CONSTRAIN_3</name>
          <description>SENSITIVE_CORE_0_PIF_PMS_CONSTRAIN_3_REG</description>
          <addressOffset>0xE4</addressOffset>
          <size>0x20</size>
          <resetValue>0x3CC0CC33</resetValue>
          <fields>
            <field>
              <name>CORE_0_PIF_PMS_CONSTRAIN_WORLD_0_SPI_2</name>
              <description>core_0_pif_pms_constrain_world_0_spi_2</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_0_PIF_PMS_CONSTRAIN_WORLD_0_APB_CTRL</name>
              <description>core_0_pif_pms_constrain_world_0_apb_ctrl</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_0_PIF_PMS_CONSTRAIN_WORLD_0_CAN</name>
              <description>core_0_pif_pms_constrain_world_0_can</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_0_PIF_PMS_CONSTRAIN_WORLD_0_I2S1</name>
              <description>core_0_pif_pms_constrain_world_0_i2s1</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_0_PIF_PMS_CONSTRAIN_WORLD_0_RWBT</name>
              <description>core_0_pif_pms_constrain_world_0_rwbt</description>
              <bitOffset>22</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_0_PIF_PMS_CONSTRAIN_WORLD_0_WIFIMAC</name>
              <description>core_0_pif_pms_constrain_world_0_wifimac</description>
              <bitOffset>26</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_0_PIF_PMS_CONSTRAIN_WORLD_0_PWR</name>
              <description>core_0_pif_pms_constrain_world_0_pwr</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_0_PIF_PMS_CONSTRAIN_4</name>
          <description>SENSITIVE_CORE_0_PIF_PMS_CONSTRAIN_4_REG</description>
          <addressOffset>0xE8</addressOffset>
          <size>0x20</size>
          <resetValue>0xFFFFF3FC</resetValue>
          <fields>
            <field>
              <name>CORE_0_PIF_PMS_CONSTRAIN_WORLD_0_USB_WRAP</name>
              <description>core_0_pif_pms_constrain_world_0_usb_wrap</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_0_PIF_PMS_CONSTRAIN_WORLD_0_CRYPTO_PERI</name>
              <description>core_0_pif_pms_constrain_world_0_crypto_peri</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_0_PIF_PMS_CONSTRAIN_WORLD_0_CRYPTO_DMA</name>
              <description>core_0_pif_pms_constrain_world_0_crypto_dma</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_0_PIF_PMS_CONSTRAIN_WORLD_0_APB_ADC</name>
              <description>core_0_pif_pms_constrain_world_0_apb_adc</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_0_PIF_PMS_CONSTRAIN_WORLD_0_BT_PWR</name>
              <description>core_0_pif_pms_constrain_world_0_bt_pwr</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_0_PIF_PMS_CONSTRAIN_WORLD_0_USB_DEVICE</name>
              <description>core_0_pif_pms_constrain_world_0_usb_device</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_0_PIF_PMS_CONSTRAIN_WORLD_0_SYSTEM</name>
              <description>core_0_pif_pms_constrain_world_0_system</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_0_PIF_PMS_CONSTRAIN_WORLD_0_SENSITIVE</name>
              <description>core_0_pif_pms_constrain_world_0_sensitive</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_0_PIF_PMS_CONSTRAIN_WORLD_0_INTERRUPT</name>
              <description>core_0_pif_pms_constrain_world_0_interrupt</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_0_PIF_PMS_CONSTRAIN_WORLD_0_DMA_COPY</name>
              <description>core_0_pif_pms_constrain_world_0_dma_copy</description>
              <bitOffset>22</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_0_PIF_PMS_CONSTRAIN_WORLD_0_CACHE_CONFIG</name>
              <description>core_0_pif_pms_constrain_world_0_cache_config</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_0_PIF_PMS_CONSTRAIN_WORLD_0_AD</name>
              <description>core_0_pif_pms_constrain_world_0_ad</description>
              <bitOffset>26</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_0_PIF_PMS_CONSTRAIN_WORLD_0_DIO</name>
              <description>core_0_pif_pms_constrain_world_0_dio</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_0_PIF_PMS_CONSTRAIN_WORLD_0_WORLD_CONTROLLER</name>
              <description>core_0_pif_pms_constrain_world_0_world_controller</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_0_PIF_PMS_CONSTRAIN_5</name>
          <description>SENSITIVE_CORE_0_PIF_PMS_CONSTRAIN_5_REG</description>
          <addressOffset>0xEC</addressOffset>
          <size>0x20</size>
          <resetValue>0xCF0FFFFF</resetValue>
          <fields>
            <field>
              <name>CORE_0_PIF_PMS_CONSTRAIN_WORLD_1_UART</name>
              <description>core_0_pif_pms_constrain_world_1_uart</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_0_PIF_PMS_CONSTRAIN_WORLD_1_G0SPI_1</name>
              <description>core_0_pif_pms_constrain_world_1_g0spi_1</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_0_PIF_PMS_CONSTRAIN_WORLD_1_G0SPI_0</name>
              <description>core_0_pif_pms_constrain_world_1_g0spi_0</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_0_PIF_PMS_CONSTRAIN_WORLD_1_GPIO</name>
              <description>core_0_pif_pms_constrain_world_1_gpio</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_0_PIF_PMS_CONSTRAIN_WORLD_1_FE2</name>
              <description>core_0_pif_pms_constrain_world_1_fe2</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_0_PIF_PMS_CONSTRAIN_WORLD_1_FE</name>
              <description>core_0_pif_pms_constrain_world_1_fe</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_0_PIF_PMS_CONSTRAIN_WORLD_1_TIMER</name>
              <description>core_0_pif_pms_constrain_world_1_timer</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_0_PIF_PMS_CONSTRAIN_WORLD_1_RTC</name>
              <description>core_0_pif_pms_constrain_world_1_rtc</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_0_PIF_PMS_CONSTRAIN_WORLD_1_IO_MUX</name>
              <description>core_0_pif_pms_constrain_world_1_io_mux</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_0_PIF_PMS_CONSTRAIN_WORLD_1_WDG</name>
              <description>core_0_pif_pms_constrain_world_1_wdg</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_0_PIF_PMS_CONSTRAIN_WORLD_1_MISC</name>
              <description>core_0_pif_pms_constrain_world_1_misc</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_0_PIF_PMS_CONSTRAIN_WORLD_1_I2C</name>
              <description>core_0_pif_pms_constrain_world_1_i2c</description>
              <bitOffset>26</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_0_PIF_PMS_CONSTRAIN_WORLD_1_UART1</name>
              <description>core_0_pif_pms_constrain_world_1_uart1</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_0_PIF_PMS_CONSTRAIN_6</name>
          <description>SENSITIVE_CORE_0_PIF_PMS_CONSTRAIN_6_REG</description>
          <addressOffset>0xF0</addressOffset>
          <size>0x20</size>
          <resetValue>0xFCC30CF3</resetValue>
          <fields>
            <field>
              <name>CORE_0_PIF_PMS_CONSTRAIN_WORLD_1_BT</name>
              <description>core_0_pif_pms_constrain_world_1_bt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_0_PIF_PMS_CONSTRAIN_WORLD_1_I2C_EXT0</name>
              <description>core_0_pif_pms_constrain_world_1_i2c_ext0</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_0_PIF_PMS_CONSTRAIN_WORLD_1_UHCI0</name>
              <description>core_0_pif_pms_constrain_world_1_uhci0</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_0_PIF_PMS_CONSTRAIN_WORLD_1_RMT</name>
              <description>core_0_pif_pms_constrain_world_1_rmt</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_0_PIF_PMS_CONSTRAIN_WORLD_1_LEDC</name>
              <description>core_0_pif_pms_constrain_world_1_ledc</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_0_PIF_PMS_CONSTRAIN_WORLD_1_BB</name>
              <description>core_0_pif_pms_constrain_world_1_bb</description>
              <bitOffset>22</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_0_PIF_PMS_CONSTRAIN_WORLD_1_TIMERGROUP</name>
              <description>core_0_pif_pms_constrain_world_1_timergroup</description>
              <bitOffset>26</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_0_PIF_PMS_CONSTRAIN_WORLD_1_TIMERGROUP1</name>
              <description>core_0_pif_pms_constrain_world_1_timergroup1</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_0_PIF_PMS_CONSTRAIN_WORLD_1_SYSTIMER</name>
              <description>core_0_pif_pms_constrain_world_1_systimer</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
