espressif/arduino-esp32/tools/ide-debug/svd/esp32c3.svd
        <register>
          <name>CORE_0_PIF_PMS_CONSTRAIN_7</name>
          <description>SENSITIVE_CORE_0_PIF_PMS_CONSTRAIN_7_REG</description>
          <addressOffset>0xF4</addressOffset>
          <size>0x20</size>
          <resetValue>0x3CC0CC33</resetValue>
          <fields>
            <field>
              <name>CORE_0_PIF_PMS_CONSTRAIN_WORLD_1_SPI_2</name>
              <description>core_0_pif_pms_constrain_world_1_spi_2</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_0_PIF_PMS_CONSTRAIN_WORLD_1_APB_CTRL</name>
              <description>core_0_pif_pms_constrain_world_1_apb_ctrl</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_0_PIF_PMS_CONSTRAIN_WORLD_1_CAN</name>
              <description>core_0_pif_pms_constrain_world_1_can</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_0_PIF_PMS_CONSTRAIN_WORLD_1_I2S1</name>
              <description>core_0_pif_pms_constrain_world_1_i2s1</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_0_PIF_PMS_CONSTRAIN_WORLD_1_RWBT</name>
              <description>core_0_pif_pms_constrain_world_1_rwbt</description>
              <bitOffset>22</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_0_PIF_PMS_CONSTRAIN_WORLD_1_WIFIMAC</name>
              <description>core_0_pif_pms_constrain_world_1_wifimac</description>
              <bitOffset>26</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_0_PIF_PMS_CONSTRAIN_WORLD_1_PWR</name>
              <description>core_0_pif_pms_constrain_world_1_pwr</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_0_PIF_PMS_CONSTRAIN_8</name>
          <description>SENSITIVE_CORE_0_PIF_PMS_CONSTRAIN_8_REG</description>
          <addressOffset>0xF8</addressOffset>
          <size>0x20</size>
          <resetValue>0xFFFFF3FC</resetValue>
          <fields>
            <field>
              <name>CORE_0_PIF_PMS_CONSTRAIN_WORLD_1_USB_WRAP</name>
              <description>core_0_pif_pms_constrain_world_1_usb_wrap</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_0_PIF_PMS_CONSTRAIN_WORLD_1_CRYPTO_PERI</name>
              <description>core_0_pif_pms_constrain_world_1_crypto_peri</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_0_PIF_PMS_CONSTRAIN_WORLD_1_CRYPTO_DMA</name>
              <description>core_0_pif_pms_constrain_world_1_crypto_dma</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_0_PIF_PMS_CONSTRAIN_WORLD_1_APB_ADC</name>
              <description>core_0_pif_pms_constrain_world_1_apb_adc</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_0_PIF_PMS_CONSTRAIN_WORLD_1_BT_PWR</name>
              <description>core_0_pif_pms_constrain_world_1_bt_pwr</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_0_PIF_PMS_CONSTRAIN_WORLD_1_USB_DEVICE</name>
              <description>core_0_pif_pms_constrain_world_1_usb_device</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_0_PIF_PMS_CONSTRAIN_WORLD_1_SYSTEM</name>
              <description>core_0_pif_pms_constrain_world_1_system</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_0_PIF_PMS_CONSTRAIN_WORLD_1_SENSITIVE</name>
              <description>core_0_pif_pms_constrain_world_1_sensitive</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_0_PIF_PMS_CONSTRAIN_WORLD_1_INTERRUPT</name>
              <description>core_0_pif_pms_constrain_world_1_interrupt</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_0_PIF_PMS_CONSTRAIN_WORLD_1_DMA_COPY</name>
              <description>core_0_pif_pms_constrain_world_1_dma_copy</description>
              <bitOffset>22</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_0_PIF_PMS_CONSTRAIN_WORLD_1_CACHE_CONFIG</name>
              <description>core_0_pif_pms_constrain_world_1_cache_config</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_0_PIF_PMS_CONSTRAIN_WORLD_1_AD</name>
              <description>core_0_pif_pms_constrain_world_1_ad</description>
              <bitOffset>26</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_0_PIF_PMS_CONSTRAIN_WORLD_1_DIO</name>
              <description>core_0_pif_pms_constrain_world_1_dio</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_0_PIF_PMS_CONSTRAIN_WORLD_1_WORLD_CONTROLLER</name>
              <description>core_0_pif_pms_constrain_world_1_world_controller</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_0_PIF_PMS_CONSTRAIN_9</name>
          <description>SENSITIVE_CORE_0_PIF_PMS_CONSTRAIN_9_REG</description>
          <addressOffset>0xFC</addressOffset>
          <size>0x20</size>
          <resetValue>0x003FFFFF</resetValue>
          <fields>
            <field>
              <name>CORE_0_PIF_PMS_CONSTRAIN_RTCFAST_SPLTADDR_WORLD_0</name>
              <description>core_0_pif_pms_constrain_rtcfast_spltaddr_world_0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_0_PIF_PMS_CONSTRAIN_RTCFAST_SPLTADDR_WORLD_1</name>
              <description>core_0_pif_pms_constrain_rtcfast_spltaddr_world_1</description>
              <bitOffset>11</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_0_PIF_PMS_CONSTRAIN_10</name>
          <description>SENSITIVE_CORE_0_PIF_PMS_CONSTRAIN_10_REG</description>
          <addressOffset>0x100</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000FFF</resetValue>
          <fields>
            <field>
              <name>CORE_0_PIF_PMS_CONSTRAIN_RTCFAST_WORLD_0_L</name>
              <description>core_0_pif_pms_constrain_rtcfast_world_0_l</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_0_PIF_PMS_CONSTRAIN_RTCFAST_WORLD_0_H</name>
              <description>core_0_pif_pms_constrain_rtcfast_world_0_h</description>
              <bitOffset>3</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_0_PIF_PMS_CONSTRAIN_RTCFAST_WORLD_1_L</name>
              <description>core_0_pif_pms_constrain_rtcfast_world_1_l</description>
              <bitOffset>6</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_0_PIF_PMS_CONSTRAIN_RTCFAST_WORLD_1_H</name>
              <description>core_0_pif_pms_constrain_rtcfast_world_1_h</description>
              <bitOffset>9</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REGION_PMS_CONSTRAIN_0</name>
          <description>SENSITIVE_REGION_PMS_CONSTRAIN_0_REG</description>
          <addressOffset>0x104</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>REGION_PMS_CONSTRAIN_LOCK</name>
              <description>region_pms_constrain_lock</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REGION_PMS_CONSTRAIN_1</name>
          <description>SENSITIVE_REGION_PMS_CONSTRAIN_1_REG</description>
          <addressOffset>0x108</addressOffset>
          <size>0x20</size>
          <resetValue>0x00003FFF</resetValue>
          <fields>
            <field>
              <name>REGION_PMS_CONSTRAIN_WORLD_0_AREA_0</name>
              <description>region_pms_constrain_world_0_area_0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REGION_PMS_CONSTRAIN_WORLD_0_AREA_1</name>
              <description>region_pms_constrain_world_0_area_1</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REGION_PMS_CONSTRAIN_WORLD_0_AREA_2</name>
              <description>region_pms_constrain_world_0_area_2</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REGION_PMS_CONSTRAIN_WORLD_0_AREA_3</name>
              <description>region_pms_constrain_world_0_area_3</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REGION_PMS_CONSTRAIN_WORLD_0_AREA_4</name>
              <description>region_pms_constrain_world_0_area_4</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REGION_PMS_CONSTRAIN_WORLD_0_AREA_5</name>
              <description>region_pms_constrain_world_0_area_5</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REGION_PMS_CONSTRAIN_WORLD_0_AREA_6</name>
              <description>region_pms_constrain_world_0_area_6</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REGION_PMS_CONSTRAIN_2</name>
          <description>SENSITIVE_REGION_PMS_CONSTRAIN_2_REG</description>
          <addressOffset>0x10C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00003FFF</resetValue>
          <fields>
            <field>
              <name>REGION_PMS_CONSTRAIN_WORLD_1_AREA_0</name>
              <description>region_pms_constrain_world_1_area_0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REGION_PMS_CONSTRAIN_WORLD_1_AREA_1</name>
              <description>region_pms_constrain_world_1_area_1</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REGION_PMS_CONSTRAIN_WORLD_1_AREA_2</name>
              <description>region_pms_constrain_world_1_area_2</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REGION_PMS_CONSTRAIN_WORLD_1_AREA_3</name>
              <description>region_pms_constrain_world_1_area_3</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REGION_PMS_CONSTRAIN_WORLD_1_AREA_4</name>
              <description>region_pms_constrain_world_1_area_4</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REGION_PMS_CONSTRAIN_WORLD_1_AREA_5</name>
              <description>region_pms_constrain_world_1_area_5</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REGION_PMS_CONSTRAIN_WORLD_1_AREA_6</name>
              <description>region_pms_constrain_world_1_area_6</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REGION_PMS_CONSTRAIN_3</name>
          <description>SENSITIVE_REGION_PMS_CONSTRAIN_3_REG</description>
          <addressOffset>0x110</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>REGION_PMS_CONSTRAIN_ADDR_0</name>
              <description>region_pms_constrain_addr_0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>30</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REGION_PMS_CONSTRAIN_4</name>
          <description>SENSITIVE_REGION_PMS_CONSTRAIN_4_REG</description>
          <addressOffset>0x114</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>REGION_PMS_CONSTRAIN_ADDR_1</name>
              <description>region_pms_constrain_addr_1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>30</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REGION_PMS_CONSTRAIN_5</name>
          <description>SENSITIVE_REGION_PMS_CONSTRAIN_5_REG</description>
          <addressOffset>0x118</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>REGION_PMS_CONSTRAIN_ADDR_2</name>
              <description>region_pms_constrain_addr_2</description>
              <bitOffset>0</bitOffset>
              <bitWidth>30</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REGION_PMS_CONSTRAIN_6</name>
          <description>SENSITIVE_REGION_PMS_CONSTRAIN_6_REG</description>
          <addressOffset>0x11C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>REGION_PMS_CONSTRAIN_ADDR_3</name>
              <description>region_pms_constrain_addr_3</description>
              <bitOffset>0</bitOffset>
              <bitWidth>30</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REGION_PMS_CONSTRAIN_7</name>
          <description>SENSITIVE_REGION_PMS_CONSTRAIN_7_REG</description>
          <addressOffset>0x120</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>REGION_PMS_CONSTRAIN_ADDR_4</name>
              <description>region_pms_constrain_addr_4</description>
              <bitOffset>0</bitOffset>
              <bitWidth>30</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REGION_PMS_CONSTRAIN_8</name>
          <description>SENSITIVE_REGION_PMS_CONSTRAIN_8_REG</description>
          <addressOffset>0x124</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>REGION_PMS_CONSTRAIN_ADDR_5</name>
              <description>region_pms_constrain_addr_5</description>
              <bitOffset>0</bitOffset>
              <bitWidth>30</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REGION_PMS_CONSTRAIN_9</name>
          <description>SENSITIVE_REGION_PMS_CONSTRAIN_9_REG</description>
          <addressOffset>0x128</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>REGION_PMS_CONSTRAIN_ADDR_6</name>
              <description>region_pms_constrain_addr_6</description>
              <bitOffset>0</bitOffset>
              <bitWidth>30</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REGION_PMS_CONSTRAIN_10</name>
          <description>SENSITIVE_REGION_PMS_CONSTRAIN_10_REG</description>
          <addressOffset>0x12C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>REGION_PMS_CONSTRAIN_ADDR_7</name>
              <description>region_pms_constrain_addr_7</description>
              <bitOffset>0</bitOffset>
              <bitWidth>30</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_0_PIF_PMS_MONITOR_0</name>
          <description>SENSITIVE_CORE_0_PIF_PMS_MONITOR_0_REG</description>
          <addressOffset>0x130</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE_0_PIF_PMS_MONITOR_LOCK</name>
              <description>core_0_pif_pms_monitor_lock</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_0_PIF_PMS_MONITOR_1</name>
          <description>SENSITIVE_CORE_0_PIF_PMS_MONITOR_1_REG</description>
          <addressOffset>0x134</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000003</resetValue>
          <fields>
            <field>
              <name>CORE_0_PIF_PMS_MONITOR_VIOLATE_CLR</name>
              <description>core_0_pif_pms_monitor_violate_clr</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_0_PIF_PMS_MONITOR_VIOLATE_EN</name>
              <description>core_0_pif_pms_monitor_violate_en</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_0_PIF_PMS_MONITOR_2</name>
          <description>SENSITIVE_CORE_0_PIF_PMS_MONITOR_2_REG</description>
          <addressOffset>0x138</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE_0_PIF_PMS_MONITOR_VIOLATE_INTR</name>
              <description>core_0_pif_pms_monitor_violate_intr</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CORE_0_PIF_PMS_MONITOR_VIOLATE_STATUS_HPORT_0</name>
              <description>core_0_pif_pms_monitor_violate_status_hport_0</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CORE_0_PIF_PMS_MONITOR_VIOLATE_STATUS_HSIZE</name>
              <description>core_0_pif_pms_monitor_violate_status_hsize</description>
              <bitOffset>2</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CORE_0_PIF_PMS_MONITOR_VIOLATE_STATUS_HWRITE</name>
              <description>core_0_pif_pms_monitor_violate_status_hwrite</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CORE_0_PIF_PMS_MONITOR_VIOLATE_STATUS_HWORLD</name>
              <description>core_0_pif_pms_monitor_violate_status_hworld</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_0_PIF_PMS_MONITOR_3</name>
          <description>SENSITIVE_CORE_0_PIF_PMS_MONITOR_3_REG</description>
          <addressOffset>0x13C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE_0_PIF_PMS_MONITOR_VIOLATE_STATUS_HADDR</name>
              <description>core_0_pif_pms_monitor_violate_status_haddr</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
